app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES ('semmi', 101, '2011-01-07 07:46:46.397234', '2011-01-07 07:46:46.397234')