app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
  	@title = @user.name
  	@microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 101) LIMIT 1
SELECT "microposts".* FROM "microposts" WHERE ("microposts".user_id = 101) ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE ("microposts".user_id = 101)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('sztike', 'legareszter@gmail.com', '2011-01-07 07:28:12.125580', '2011-01-07 07:28:12.125580', '899db46e630f8f682c5012fcf3811adf5bdeff6ba8f6e1f323fd3a5a8e0a64a6', '62bc5ebf24e1ba9e48d7271f6fcbac965133ac9ffdc69752b4f0da8e8caf4f5a', 'f')